E = int(input("ใส่ค่าแรงดันไฟฟฟ้าของแหล่งจ่ายไฟฟ้า(โวลต์) : "))
R1 = int(input ("ใส่ค่าความต้านทานตัวที่ 1 (โอมห์) : "))
R2 = int(input ("ใส่ค่าความต้านทานตัวที่ 2 (โอมห์) : "))
R3 = int(input ("ใส่ค่าความต้านทานตัวที่ 3 (โอมห์) : "))

R = R1+R2+R3
I = E/R

print ("ค่าพระแสไฟฟ้า(I)ของวงจร : ",(I)," แอมป์")
print ("ค่าแรงดันไฟฟ้าตกคร่อมความต้านทานตัวที่ 1 : ",(I*R1),"โวลต์")
print ("ค่าแรงดันไฟฟ้าตกคร่อมความต้านทานตัวที่ 1 : ",(I*R2),"โวลต์")
print ("ค่าแรงดันไฟฟ้าตกคร่อมความต้านทานตัวที่ 1 : ",(I*R3),"โวลต์")
